# battery_simulator/parameters/ocv.py

import pandas as pd


def get_ocv_6s2p():
    """
    OCV_6S2P 모델의 OCV 데이터를 반환합니다.

    SOC 값은 100부터 0까지 5 단위로 설정되며,
    각 SOC에 대응하는 전압 값은 아래와 같습니다:

        24.45, 24.16, 23.83, 23.53, 23.285,
        23.035, 22.77, 22.56, 22.245, 21.98,
        21.85, 21.73, 21.635, 21.555, 21.46,
        21.285, 21.09, 20.76, 20.595, 20.41,
        18.72

    Returns:
        pandas.DataFrame: 'soc'와 'ocv' 열을 가진 DataFrame
    """
    soc = list(range(100, -1, -5))
    ocv = [
        24.45,
        24.16,
        23.83,
        23.53,
        23.285,
        23.035,
        22.77,
        22.56,
        22.245,
        21.98,
        21.85,
        21.73,
        21.635,
        21.555,
        21.46,
        21.285,
        21.09,
        20.76,
        20.595,
        20.41,
        18.72,
    ]
    return pd.DataFrame({"soc": soc, "ocv": ocv})


def get_ocv_cell():
    """
    OCV_CELL 데이터 반환 함수입니다.

    SOC는 100부터 0까지 5 단위로 설정되며,
    ocv_cell 값은 아래와 같이 주어집니다:

        4.081757839,
        4.036469062,
        3.981780728,
        3.932433051,
        3.891630426,
        3.84975967,
        3.807248035,
        3.766231785,
        3.713466087,
        3.667963684,
        3.645319295,
        3.627374685,
        3.611779965,
        3.59703975,
        3.58080415,
        3.553459983,
        3.514579995,
        3.459891661,
        3.428274968,
        3.388754101,
        3.104417487

    Returns:
        pandas.DataFrame: 'soc'와 'ocv' 열을 가진 DataFrame
    """
    soc = list(range(100, -1, -5))
    ocv_cell = [
        4.081757839,
        4.036469062,
        3.981780728,
        3.932433051,
        3.891630426,
        3.84975967,
        3.807248035,
        3.766231785,
        3.713466087,
        3.667963684,
        3.645319295,
        3.627374685,
        3.611779965,
        3.59703975,
        3.58080415,
        3.553459983,
        3.514579995,
        3.459891661,
        3.428274968,
        3.388754101,
        3.104417487,
    ]
    return pd.DataFrame({"soc": soc, "ocv": ocv_cell})


# 추후 다른 모델의 OCV 데이터도 쉽게 추가할 수 있도록 딕셔너리로 관리합니다.
OCV_DATA = {"OCV_6S2P": get_ocv_6s2p(), "OCV_CELL": get_ocv_cell()}
